In [55]:
import pandas as pd
import numpy as np
df1 = pd.read_csv("Patient_Data.csv")
df2 = pd.read_csv("Billing_Data.csv")
df1

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [56]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [57]:
df1.isnull().sum()

PatientID         0
Name              0
Department        0
Doctor            0
BillAmount        2
ReceptionistID    0
CheckInTime       0
dtype: int64

In [58]:
df1[["PatientID","Department","Doctor","BillAmount"]].head()

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN

In [59]:
df1.drop(["ReceptionistID","CheckInTime"],inplace=False,axis = 1)

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [60]:
df1.groupby("Department")["BillAmount"].sum().reset_index()

    Department  BillAmount
0   Cardiology     16200.0
1  Dermatology         0.0
2    Neurology         0.0
3  Orthopedics      7500.0

In [61]:
df1 = df1.drop_duplicates(subset='PatientID')#5.	Remove duplicate patient records based on PatientID.
df1

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [62]:
df1['BillAmount'].mean()

np.float64(6233.333333333333)

In [63]:
import numpy as np
d1 = np.round(df1['BillAmount'].mean(),1)
d1

np.float64(6233.3)

In [64]:
df1['BillAmount'].fillna(value=d1, inplace=True)
df1

C:\Users\yaram\AppData\Local\Temp\ipykernel_22364\1957026442.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['BillAmount'].fillna(value=d1, inplace=True)
C:\Users\yaram\AppData\Local\Temp\ipykernel_22364\1957026442.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['BillAmount'].fillna(value=d1, inplace=True)

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,6233.3,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,6233.3,2,2023-01-14 08:45

In [65]:
df1

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,6233.3,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,6233.3,2,2023-01-14 08:45

In [66]:
df2

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [67]:
df3 = pd.concat([df1,df2],ignore_index=True)
df3

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,1.0,2023-01-10 09:00,NaN,NaN
1,102,Bob,Neurology,Dr. John,6233.3,2.0,2023-01-11 10:30,NaN,NaN
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1.0,2023-01-12 11:00,NaN,NaN
3,104,David,Cardiology,Dr. Smith,6200.0,3.0,2023-01-13 12:00,NaN,NaN
4,105,Eva,Dermatology,Dr. Rose,6233.3,2.0,2023-01-14 08:45,NaN,NaN
5,101,NaN,NaN,NaN,NaN,NaN,NaN,2000.0,3000.0
6,102,NaN,NaN,NaN,NaN,NaN,NaN,1500.0,3500.0
7,103,NaN,NaN,NaN,NaN,NaN,NaN,2500.0,5000.0
8,104,NaN,NaN,NaN,NaN,NaN,NaN,3000.0,3200.0
9,105,NaN,NaN,NaN,NaN,NaN,NaN,1000.0,4000.0

In [68]:
df4 = pd.concat([df3,df2],ignore_index=True)

In [69]:
df4

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,1.0,2023-01-10 09:00,NaN,NaN
1,102,Bob,Neurology,Dr. John,6233.3,2.0,2023-01-11 10:30,NaN,NaN
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1.0,2023-01-12 11:00,NaN,NaN
3,104,David,Cardiology,Dr. Smith,6200.0,3.0,2023-01-13 12:00,NaN,NaN
4,105,Eva,Dermatology,Dr. Rose,6233.3,2.0,2023-01-14 08:45,NaN,NaN
5,101,NaN,NaN,NaN,NaN,NaN,NaN,2000.0,3000.0
6,102,NaN,NaN,NaN,NaN,NaN,NaN,1500.0,3500.0
7,103,NaN,NaN,NaN,NaN,NaN,NaN,2500.0,5000.0
8,104,NaN,NaN,NaN,NaN,NaN,NaN,3000.0,3200.0
9,105,NaN,NaN,NaN,NaN,NaN,NaN,1000.0,4000.0
10,101,NaN,NaN,NaN,NaN,NaN,NaN,2000.0,3000.0
11,102,NaN,NaN,NaN,NaN,NaN,NaN,1500.0,3500.0
12,103,NaN,NaN,NaN,NaN,NaN,NaN,2500.0,5000.0
13,104,NaN,NaN,NaN,NaN,NaN,NaN,3000.0,3200.0
14,105,NaN,NaN,NaN,NaN,NaN,NaN,1000.0,4000.0